Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFE144.PIC
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BadInstr" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="BadInstr" edc:nmmrflags="0t" edc:nmmrid="288" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BadInstr" edc:desc="" edc:mask="0xffffffff" edc:name="BadInstr" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BadInstrP" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="BadInstrP" edc:nmmrflags="0t" edc:nmmrid="416" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BadInstrP" edc:desc="" edc:mask="0xffffffff" edc:name="BadInstrP" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="Count" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="Count" edc:nmmrflags="0t" edc:nmmrid="164" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Count" edc:desc="" edc:mask="0xffffffff" edc:name="Count" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnn-----nnnnnnnnn" edc:cname="EntryHi" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="EntryHi" edc:nmmrflags="0t" edc:nmmrid="168" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="VPN2" edc:desc="" edc:mask="0x7ffff" edc:name="VPN2" edc:nzwidth="0x13"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="Compare" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="Compare" edc:nmmrflags="0t" edc:nmmrid="172" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Compare" edc:desc="" edc:mask="0xffffffff" edc:name="Compare" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="--nnnnnn-nnnnn-nnnnnnn-----n-nnn" edc:cname="Status" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00u00u00010000000000000000000000" edc:name="Status" edc:nmmrflags="0t" edc:nmmrid="176" edc:nzwidth="0x20" edc:por="00x00x00010000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:access="" edc:id="DS.0" edc:mclr="" edc:por="">
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXL" edc:desc="" edc:mask="0x1" edc:name="EXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERL" edc:desc="" edc:mask="0x1" edc:name="ERL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="UM" edc:desc="" edc:mask="0x1" edc:name="UM" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="IPL" edc:desc="" edc:mask="0x7f" edc:name="IPL" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="IPL7" edc:desc="" edc:mask="0x1" edc:name="IPL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NMI" edc:desc="" edc:mask="0x1" edc:name="NMI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR" edc:desc="" edc:mask="0x1" edc:name="SR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TS" edc:desc="" edc:mask="0x1" edc:name="TS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BEV" edc:desc="" edc:mask="0x1" edc:name="BEV" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MX" edc:desc="" edc:mask="0x1" edc:name="MX" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE" edc:desc="" edc:mask="0x1" edc:name="RE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR" edc:mask="0x1" edc:name="FR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RP" edc:desc="" edc:mask="0x1" edc:name="RP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CU0" edc:desc="" edc:mask="0x1" edc:name="CU0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CU1" edc:mask="0x1" edc:name="CU1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="---------nnnnnnnnnn---nnnnn-----" edc:cname="IntCtl" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IntCtl" edc:nmmrflags="0a" edc:nmmrid="304" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="VS" edc:desc="" edc:mask="0x1f" edc:name="VS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="USESTK" edc:desc="" edc:mask="0x1" edc:name="USESTK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APE" edc:desc="" edc:mask="0x1" edc:name="APE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLREXL" edc:desc="" edc:mask="0x1" edc:name="CLREXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STKDEC" edc:desc="" edc:mask="0x1f" edc:name="STKDEC" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="ICE" edc:desc="" edc:mask="0x1" edc:name="ICE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PF" edc:desc="" edc:mask="0x1" edc:name="PF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="--rrrr----rrrr--nnnn--nnnn--rrrr" edc:cname="SRSCtl" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00011100000000000000000000000000" edc:name="SRSCtl" edc:nmmrflags="0b" edc:nmmrid="432" edc:nzwidth="0x20" edc:por="00011100000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="" edc:mask="0xf" edc:name="CSS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0xf" edc:name="PSS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ESS" edc:desc="" edc:mask="0xf" edc:name="ESS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="EICSS" edc:desc="" edc:mask="0xf" edc:name="EICSS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="HSS" edc:desc="" edc:mask="0xf" edc:name="HSS" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRSMap" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SRSMap" edc:nmmrflags="0c" edc:nmmrid="560" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SSV0" edc:desc="" edc:mask="0xf" edc:name="SSV0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV1" edc:desc="" edc:mask="0xf" edc:name="SSV1" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV2" edc:desc="" edc:mask="0xf" edc:name="SSV2" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV3" edc:desc="" edc:mask="0xf" edc:name="SSV3" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV4" edc:desc="" edc:mask="0xf" edc:name="SSV4" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV5" edc:desc="" edc:mask="0xf" edc:name="SSV5" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV6" edc:desc="" edc:mask="0xf" edc:name="SSV6" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV7" edc:desc="" edc:mask="0xf" edc:name="SSV7" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="----------------------nnnnnnnn--" edc:cname="View_IPL" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="View_IPL" edc:nmmrflags="0d" edc:nmmrid="688" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="IPL" edc:desc="" edc:mask="0xff" edc:name="IPL" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRSMAP2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SRSMAP2" edc:nmmrflags="0e" edc:nmmrid="816" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SSV8" edc:desc="" edc:mask="0xf" edc:name="SSV8" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV9" edc:desc="" edc:mask="0xf" edc:name="SSV9" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GTOffset" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GTOffset" edc:nmmrflags="0e" edc:nmmrid="1072" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GTOffset" edc:desc="" edc:mask="0xFFFFFFFF" edc:name="GTOffset" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="rrrrnrrrnnr---rrrrrrrrnn-rrrrr--" edc:cname="Cause" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="Cause" edc:nmmrflags="0t" edc:nmmrid="180" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ExcCode" edc:desc="" edc:mask="0x1f" edc:name="ExcCode" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="IP" edc:desc="" edc:mask="0x3" edc:name="IP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RIPL" edc:desc="" edc:mask="0xff" edc:name="RIPL" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="FDCI" edc:desc="" edc:mask="0x1" edc:name="FDCI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WP" edc:desc="" edc:mask="0x1" edc:name="WP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IV" edc:desc="" edc:mask="0x1" edc:name="IV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AP" edc:desc="" edc:mask="0x1" edc:name="AP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC" edc:desc="" edc:mask="0x1" edc:name="IC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCI" edc:desc="" edc:mask="0x1" edc:name="PCI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CE" edc:desc="" edc:mask="0x3" edc:name="CE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TI" edc:desc="" edc:mask="0x1" edc:name="TI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BD" edc:desc="" edc:mask="0x1" edc:name="BD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="----------------------rrrrrrrrnn" edc:cname="View_RIPL" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="View_RIPL" edc:nmmrflags="0d" edc:nmmrid="692" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IP" edc:desc="" edc:mask="0x3" edc:name="IP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RIPL" edc:desc="" edc:mask="0xff" edc:name="RIPL" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="-----------------------------nn-" edc:cname="NestedExc" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NestedExc" edc:nmmrflags="0e" edc:nmmrid="820" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="NEXL" edc:desc="" edc:mask="0x3" edc:name="NEXL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="NERL" edc:desc="" edc:mask="0x3" edc:name="NERL" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="EPC" edc:nmmrflags="0t" edc:nmmrid="184" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPC" edc:desc="" edc:mask="0xffffffff" edc:name="EPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NestedEPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NestedEPC" edc:nmmrflags="0b" edc:nmmrid="440" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPC" edc:desc="" edc:mask="0xffffffff" edc:name="EPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PRId" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000010000000000000000" edc:name="PRId" edc:nmmrflags="0t" edc:nmmrid="188" edc:nzwidth="0x20" edc:por="00000000000000010000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Patch" edc:desc="" edc:mask="0x3" edc:name="Patch" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="MINrev" edc:desc="" edc:mask="0x7" edc:name="MINrev" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="MAJrev" edc:desc="" edc:mask="0x7" edc:name="MAJrev" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="PrID" edc:desc="" edc:mask="0xff" edc:name="PrID" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CoID" edc:desc="" edc:mask="0xff" edc:name="CoID" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="rrnnnnnnnnnnnnnnnnnn--rrrrrrrrrr" edc:cname="EBASE" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="EBASE" edc:nmmrflags="0a" edc:nmmrid="316" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CPUNum" edc:desc="" edc:mask="0x3ff" edc:name="CPUNum" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ExBase" edc:desc="" edc:mask="0x3ffff" edc:name="ExBase" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnrrrrrrrrrr" edc:cname="CDMMBase" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CDMMBase" edc:nmmrflags="0b" edc:nmmrid="444" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CDMMSize" edc:desc="" edc:mask="0x1ff" edc:name="CDMMSize" edc:nzwidth="0x9"/>
            <edc:SFRFieldDef edc:cname="CI" edc:desc="" edc:mask="0x1" edc:name="CI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CDMMUA" edc:desc="" edc:mask="0x3fffff" edc:name="CDMMUA" edc:nzwidth="0x15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
