Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFE144.PIC
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnrrrnnnnnnnnnnnnnnnnnn" edc:cname="FCSR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000011000000000000000000" edc:name="FCSR" edc:nmmrflags="0t" edc:nmmrid="1660" edc:nzwidth="0x20" edc:por="00000000000011000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RM" edc:desc="" edc:mask="0x3" edc:name="RM" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLAGS" edc:desc="" edc:mask="0x1F" edc:name="FLAGS" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="ENABLES" edc:desc="" edc:mask="0x1f" edc:name="ENABLES" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="CAUSE" edc:desc="" edc:mask="0x3f" edc:name="CAUSE" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="NAN2008" edc:desc="" edc:mask="0x1" edc:name="NAN2008" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ABS2008" edc:desc="" edc:mask="0x1" edc:name="ABS2008" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MAC2008" edc:desc="" edc:mask="0x1" edc:name="MAC2008" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FN" edc:desc="" edc:mask="0x1" edc:name="FN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FO" edc:desc="" edc:mask="0x1" edc:name="FO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCC0" edc:desc="" edc:mask="0x1" edc:name="FCC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FS" edc:desc="" edc:mask="0x1" edc:name="FS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCC" edc:desc="" edc:mask="0x5f" edc:name="FCC" edc:nzwidth="0x7"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FLAGS_I" edc:desc="" edc:mask="0x1" edc:name="FLAGS_I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_U" edc:desc="" edc:mask="0x1" edc:name="FLAGS_U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_O" edc:desc="" edc:mask="0x1" edc:name="FLAGS_O" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_Z" edc:desc="" edc:mask="0x1" edc:name="FLAGS_Z" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_V" edc:desc="" edc:mask="0x1" edc:name="FLAGS_V" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_I" edc:desc="" edc:mask="0x1" edc:name="ENABLES_I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_U" edc:desc="" edc:mask="0x1" edc:name="ENABLES_U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_O" edc:desc="" edc:mask="0x1" edc:name="ENABLES_O" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_Z" edc:desc="" edc:mask="0x1" edc:name="ENABLES_Z" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_V" edc:desc="" edc:mask="0x1" edc:name="ENABLES_V" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_I" edc:desc="" edc:mask="0x1" edc:name="CAUSE_I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_U" edc:desc="" edc:mask="0x1" edc:name="CAUSE_U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_O" edc:desc="" edc:mask="0x1" edc:name="CAUSE_O" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_Z" edc:desc="" edc:mask="0x1" edc:name="CAUSE_Z" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_V" edc:desc="" edc:mask="0x1" edc:name="CAUSE_V" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_E" edc:desc="" edc:mask="0x1" edc:name="CAUSE_R" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="KScratch1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="KScratch1" edc:nmmrflags="St" edc:nmmrid="508" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="KScratch1" edc:desc="" edc:mask="0xffffffff" edc:name="KScratch1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:NMMRPlace>
    <edc:EmulatorSector edc:beginaddr="0xff300000" edc:endaddr="0xff400000" edc:regionid="emulation"/>
    <edc:DeviceIDSector edc:_mask="0x0fffffff" edc:beginaddr="0xffffffff" edc:endaddr="0xffffffff" edc:mask="0x0fffffff" edc:regionid="devid" edc:useinchecksum="0x0fffffff" edc:value="0x7220053">
      <edc:DEVIDToRev edc:revlist="A1" edc:value="0x10000000"/>
      <edc:DEVIDToRev edc:revlist="A2" edc:value="0x20000000"/>
      <edc:DEVIDToRev edc:revlist="A3" edc:value="0x30000000"/>
      <edc:DEVIDToRev edc:revlist="B0" edc:value="0x40000000"/>
      <edc:DEVIDToRev edc:revlist="B1" edc:value="0x50000000"/>
      <edc:DEVIDToRev edc:revlist="B2" edc:value="0x60000000"/>
    </edc:DeviceIDSector>
    <edc:CodeSector edc:beginaddr="0x1d000000" edc:endaddr="0x1d100000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:kuseg="0x60000000" edc:regionid="code"/>
    <edc:TestZone edc:beginaddr="0x1fc74000" edc:endaddr="0x1fc78000" edc:regionid="testmem"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc40000" edc:endaddr="0x1fc4ff00" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot1"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc50000" edc:endaddr="0x1fc54000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot1lastpage"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc60000" edc:endaddr="0x1fc6ff00" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot2"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc70000" edc:endaddr="0x1fc74000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot2lastpage"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc20000" edc:endaddr="0x1fc2ff00" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="upperbootalias"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc30000" edc:endaddr="0x1fc34000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="upperbootaliaslastpage"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc00000" edc:endaddr="0x1fc0ff00" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="lowerbootalias"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc10000" edc:endaddr="0x1fc14000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="lowerbootaliaslastpage"/>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc0ffc0" edc:endaddr="0x1fc10000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="lowerbootaliasconfig">
      <edc:DCRDef edc:_addr="0x1FC0FFC0" edc:access="-nnnn-nn--------nnnnnnnnnnnnnnnn" edc:cname="DEVCFG3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x7b00ffff" edc:name="DEVCFG3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xFFFF0000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="FMIIEN" edc:desc="Ethernet RMII/MII Enable" edc:mask="0x1" edc:name="FMIIEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RMII Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="MII Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FETHIO" edc:desc="Ethernet I/O Pin Select" edc:mask="0x1" edc:name="FETHIO" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Alternate Ethernet I/O" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Default Ethernet I/O" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="PGL1WAY" edc:desc="Permission Group Lock One Way Configuration" edc:mask="0x1" edc:name="PGL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PMDL1WAY" edc:desc="Peripheral Module Disable Configuration" edc:mask="0x1" edc:name="PMDL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="Peripheral Pin Select Configuration" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FUSBIDIO" edc:desc="USB USBID Selection" edc:mask="0x1" edc:name="FUSBIDIO" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Controlled by Port Function" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Controlled by the USB Module" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
