Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFE144.PIC
      <edc:SFRDef edc:_addr="0x1F8601A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------n---nnn--n-n---" edc:cname="CNNEB" edc:desc="" edc:impl="0x4728" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------0---000--0-0---" edc:name="CNNEB" edc:nzwidth="32" edc:por="-----------------0---000--0-0---" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEB3" edc:mask="0x1" edc:name="CNNEB3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEB5" edc:mask="0x1" edc:name="CNNEB5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEB8" edc:mask="0x1" edc:name="CNNEB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB9" edc:mask="0x1" edc:name="CNNEB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB10" edc:mask="0x1" edc:name="CNNEB10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEB14" edc:mask="0x1" edc:name="CNNEB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8601B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNFB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNFB" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFB0" edc:mask="0x1" edc:name="CNFB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB1" edc:mask="0x1" edc:name="CNFB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB2" edc:mask="0x1" edc:name="CNFB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB3" edc:mask="0x1" edc:name="CNFB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB4" edc:mask="0x1" edc:name="CNFB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB5" edc:mask="0x1" edc:name="CNFB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB6" edc:mask="0x1" edc:name="CNFB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB7" edc:mask="0x1" edc:name="CNFB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB8" edc:mask="0x1" edc:name="CNFB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB9" edc:mask="0x1" edc:name="CNFB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB10" edc:mask="0x1" edc:name="CNFB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB11" edc:mask="0x1" edc:name="CNFB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB12" edc:mask="0x1" edc:name="CNFB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB13" edc:mask="0x1" edc:name="CNFB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB14" edc:mask="0x1" edc:name="CNFB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB15" edc:mask="0x1" edc:name="CNFB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8601C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SRCON0B" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SRCON0B" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0B0" edc:mask="0x1" edc:name="SR0B0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SR0B1" edc:mask="0x1" edc:name="SR0B1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B2" edc:mask="0x1" edc:name="SR0B2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B3" edc:mask="0x1" edc:name="SR0B3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B4" edc:mask="0x1" edc:name="SR0B4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B5" edc:mask="0x1" edc:name="SR0B5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B6" edc:mask="0x1" edc:name="SR0B6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B7" edc:mask="0x1" edc:name="SR0B7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B8" edc:mask="0x1" edc:name="SR0B8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B9" edc:mask="0x1" edc:name="SR0B9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B10" edc:mask="0x1" edc:name="SR0B10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B11" edc:mask="0x1" edc:name="SR0B11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B12" edc:mask="0x1" edc:name="SR0B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B13" edc:mask="0x1" edc:name="SR0B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B14" edc:mask="0x1" edc:name="SR0B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B15" edc:mask="0x1" edc:name="SR0B15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8601D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SRCON1B" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SRCON1B" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1B0" edc:mask="0x1" edc:name="SR1B0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B1" edc:mask="0x1" edc:name="SR1B1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B2" edc:mask="0x1" edc:name="SR1B2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B3" edc:mask="0x1" edc:name="SR1B3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B4" edc:mask="0x1" edc:name="SR1B4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B5" edc:mask="0x1" edc:name="SR1B5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B6" edc:mask="0x1" edc:name="SR1B6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B7" edc:mask="0x1" edc:name="SR1B7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B8" edc:mask="0x1" edc:name="SR1B8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B9" edc:mask="0x1" edc:name="SR1B9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B10" edc:mask="0x1" edc:name="SR1B10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B11" edc:mask="0x1" edc:name="SR1B11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B12" edc:mask="0x1" edc:name="SR1B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B13" edc:mask="0x1" edc:name="SR1B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B14" edc:mask="0x1" edc:name="SR1B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1B15" edc:mask="0x1" edc:name="SR1B15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
