Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFE144.PIC
      <edc:SFRDef edc:_addr="0x1F860970" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="----------------n---n-----------" edc:cname="CNCONK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONK" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE K" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860980" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="CNENK" edc:desc="" edc:grp="PORTK" edc:impl="0xffc000ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNENK" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEK0" edc:desc="" edc:mask="0x1" edc:name="CNIEK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK1" edc:desc="" edc:mask="0x1" edc:name="CNIEK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK2" edc:desc="" edc:mask="0x1" edc:name="CNIEK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK3" edc:desc="" edc:mask="0x1" edc:name="CNIEK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK4" edc:desc="" edc:mask="0x1" edc:name="CNIEK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK5" edc:desc="" edc:mask="0x1" edc:name="CNIEK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK6" edc:desc="" edc:mask="0x1" edc:name="CNIEK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK7" edc:desc="" edc:mask="0x1" edc:name="CNIEK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860990" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="CNSTATK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNSTATK" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATK0" edc:desc="" edc:mask="0x1" edc:name="CNSTATK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK1" edc:desc="" edc:mask="0x1" edc:name="CNSTATK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK2" edc:desc="" edc:mask="0x1" edc:name="CNSTATK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK3" edc:desc="" edc:mask="0x1" edc:name="CNSTATK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK4" edc:desc="" edc:mask="0x1" edc:name="CNSTATK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK5" edc:desc="" edc:mask="0x1" edc:name="CNSTATK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK6" edc:desc="" edc:mask="0x1" edc:name="CNSTATK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK7" edc:desc="" edc:mask="0x1" edc:name="CNSTATK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8609A0" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNNEK" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNNEK" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEK0" edc:mask="0x1" edc:name="CNNEK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK1" edc:mask="0x1" edc:name="CNNEK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK2" edc:mask="0x1" edc:name="CNNEK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK3" edc:mask="0x1" edc:name="CNNEK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK4" edc:mask="0x1" edc:name="CNNEK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK5" edc:mask="0x1" edc:name="CNNEK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK6" edc:mask="0x1" edc:name="CNNEK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK7" edc:mask="0x1" edc:name="CNNEK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK8" edc:mask="0x1" edc:name="CNNEK8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK9" edc:mask="0x1" edc:name="CNNEK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK10" edc:mask="0x1" edc:name="CNNEK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK11" edc:mask="0x1" edc:name="CNNEK11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK12" edc:mask="0x1" edc:name="CNNEK12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK13" edc:mask="0x1" edc:name="CNNEK13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK14" edc:mask="0x1" edc:name="CNNEK14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK15" edc:mask="0x1" edc:name="CNNEK15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8609B0" edc:_begin="0x10" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNFK" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNFK" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFK0" edc:mask="0x1" edc:name="CNFK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK1" edc:mask="0x1" edc:name="CNFK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK2" edc:mask="0x1" edc:name="CNFK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK3" edc:mask="0x1" edc:name="CNFK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK4" edc:mask="0x1" edc:name="CNFK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK5" edc:mask="0x1" edc:name="CNFK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK6" edc:mask="0x1" edc:name="CNFK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK7" edc:mask="0x1" edc:name="CNFK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK8" edc:mask="0x1" edc:name="CNFK8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK9" edc:mask="0x1" edc:name="CNFK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK10" edc:mask="0x1" edc:name="CNFK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK11" edc:mask="0x1" edc:name="CNFK11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK12" edc:mask="0x1" edc:name="CNFK12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK13" edc:mask="0x1" edc:name="CNFK13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK14" edc:mask="0x1" edc:name="CNFK14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK15" edc:mask="0x1" edc:name="CNFK15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f880000" edc:endaddr="0x1f885000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb5_std">
      <edc:AdjustPoint edc:_addr="0x1F880000" edc:offset="0x2000"/>
      <edc:SFRDef edc:_addr="0x1F882000" edc:_begin="0x0" edc:_end="0xf0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnn---nnn--n---n" edc:cname="ETHCON1" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000xxx000xx0xxx0" edc:name="ETHCON1" edc:nzwidth="0x20" edc:por="0000000000000000000xxx000xx0xxx0" edc:portals="CLR SET INV" ltx:baseofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUFCDEC" edc:desc="" edc:mask="0x1" edc:name="BUFCDEC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="MANFC" edc:desc="" edc:mask="0x1" edc:name="MANFC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="AUTOFC" edc:desc="" edc:mask="0x1" edc:name="AUTOFC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="" edc:mask="0x1" edc:name="RXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRTS" edc:desc="" edc:mask="0x1" edc:name="TXRTS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTV" edc:desc="" edc:mask="0xffff" edc:name="PTV" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="ETHERNET CONTROLLER" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882010" edc:_begin="0x0" edc:_end="0xf0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="---------------------nnnnnnn----" edc:cname="ETHCON2" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxx0000000xxxx" edc:name="ETHCON2" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxx0000000xxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RXBUF_SZ" edc:desc="" edc:mask="0x7f" edc:name="RXBUF_SZ" edc:nzwidth="0x7"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
